Autodesk.Revit.DB.Electrical.ElectricalSystem.IsCircuitPathValid(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Checks whether the list of the electrical system circuit path node position is valid.
Remarks:
The length of the list should be more than one, the first node should be the position of the panel where the circuit begins at, the adjacent nodes should not be too close, and should be in the same level or on the same vertical line, to keep each segment of the circuit path always horizontal or vertical.
nodes:
The list of the electrical system circuit path node position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.SetCircuitPath(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Sets the electrical system circuit path by the list of node position.
Remarks:
If succeed, it will also change the CircuitPathMode property to Custom mode implicitly.
nodes:
The list of the circuit path node position.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The list of the electrical system circuit path node position is not valid. The length of the list should be more than one, the first node should be the position of the panel where the circuit begins at, the adjacent nodes should not be too close, and should be in the same level or on the same vertical line, to keep each segment of the circuit path always horizontal or vertical.
Also note that the first node position should be the position of the connector (the one connects to the circuit) of the panel, but not the origin of the panel instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.GetCircuitPath
Gets the list of the electrical system circuit path node position.
Returns:
The list of the electrical system circuit path node position.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.DisconnectPanel
Disconnect the panel for the Electrical System.
Remarks:
If successful, the system will disconnect this panel. Otherwise the exception will be thrown.
This method will only function with the Autodesk Revit MEP application.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the panel cannot be disconnected for the electrical system.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.SelectPanel(Autodesk.Revit.DB.FamilyInstance)
Set the panel for the Electrical System.
Remarks:
If successful, the panel will be set for the system. Otherwise the exception will be thrown.
This method will only function with the Autodesk Revit MEP application.
panel:
The panel of the electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the panel cannot be set for the electrical system.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.Create(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Electrical.ElectricalSystemType)
Creates a new MEP Electrical System element from an unused Connector.
connector:
The Connector to create this Electrical System.
elecSysType:
The System Type of electrical system.
Returns:
If successful a new MEP Electrical System element within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Electrical.ElectricalSystemType)
Creates a new MEP Electrical System element from a set of electrical components.
document:
The Document.
electComponents:
The electrical components in this system.
elecSysType:
The System Type of electrical system.
Returns:
If successful a new MEP Electrical System element within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There should be at least one component that can create the specified circuit type
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitPathMode
The circuit path mode of the electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The electrical system circuit path does not have customized path, so the CircuitPathMode cannot be set as Custom.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.HasCustomCircuitPath
Checks whether the electrical system circuit path has been customized. If not, the property CircuitPathMode cannot be set as Custom explicitly.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.PanelName
The Panel name of the Electrical System.
Remarks:
This property is used to retrieve the Panel name of the Electrical System.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitType
The circuit type of the Electrical System.
Remarks:
This read-only property is used to retrieve the circuit type of the Electrical System.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.GroundConductorsNumber
The GroundConductors Number of the Electrical System.
Remarks:
This property is used to retrieve the GroundConductors Number of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.NeutralConductorsNumber
The NeutralConductors Number of the Electrical System.
Remarks:
This property is used to retrieve the NeutralConductors Number of the Electrical System.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.HotConductorsNumber
The HotConductors Number of the Electrical System.
Remarks:
This property is used to retrieve the HotConductors Number of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.RunsNumber
The Runs Number of the Electrical System.
Remarks:
This property is used to retrieve the Runs Number of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.BalancedLoad
Reports whether the BalancedLoad is on or off.
Remarks:
This property is used to retrieve the BalancedLoad value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.PolesNumber
The Poles Number of the Electrical System.
Remarks:
This property is used to retrieve the Poles Number of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.LoadClassifications
The LoadClassifications used in the Electrical System.
Remarks:
This property is used to retrieve the LoadClassifications of the Electrical System.
There may be one or more load classification in use in which case they will be semi-colon delimited.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.PowerFactorState
The PowerFactorState type of the Electrical System.
Remarks:
This property is used to retrieve the PowerFactorState type of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.SystemType
The Electrical System Type of the Electrical System.
Remarks:
This property is used to retrieve the Electrical System Type of the Electrical System.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.VoltageDrop
The VoltageDrop value of the Electrical System.
Remarks:
This property is used to retrieve the VoltageDrop value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
-or-
Thrown when the voltage drop cannot be computed, because it is zero, or because the circuit is not connected to a panel.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseC
The TrueCurrentPhaseC value of the Electrical System.
Remarks:
This property is used to retrieve the TrueCurrentPhaseC value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseB
The TrueCurrentPhaseB value of the Electrical System.
Remarks:
This property is used to retrieve the TrueCurrentPhaseB value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseA
The TrueCurrentPhaseA value of the Electrical System.
Remarks:
This property is used to retrieve the TrueCurrentPhaseA value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrent
The TrueCurrent value of the Electrical System.
Remarks:
This property is used to retrieve the TrueCurrent value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseC
The ApparentCurrentPhaseC value of the Electrical System.
Remarks:
This property is used to retrieve the ApparentCurrentPhaseC value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseB
The ApparentCurrentPhaseB value of the Electrical System.
Remarks:
This property is used to retrieve the ApparentCurrentPhaseB value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseA
The ApparentCurrentPhaseA value of the Electrical System.
Remarks:
This property is used to retrieve the ApparentCurrentPhaseA value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrent
The ApparentCurrent value of the Electrical System.
Remarks:
This property is used to retrieve the ApparentCurrent value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.Length
The Length value of the Electrical System.
Remarks:
This property is used to retrieve the Length value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the length cannot be computed, because it is zero, or because the circuit is not connected to a panel.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.HasPathOffset
Whether the circuit path has a valid offset.
Remarks:
Circuit path of AllDevices and Custom mode may not have valid offset if the horizontal segments of the path are not at the same height.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.PathOffset
The offset of the horizontal segments of the circuit path.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for pathOffset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.Rating
The Rating value of the Electrical System.
Remarks:
This property is used to retrieve the Rating value of the Electrical System.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for rating is not a number
-or-
When setting this property: The given value for rating is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for rating must be non-negative.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseC
The TrueLoadPhaseC value of the Electrical System.
Remarks:
This property is used to retrieve the TrueLoadPhaseC value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseB
The TrueLoadPhaseB value of the Electrical System.
Remarks:
This property is used to retrieve the TrueLoadPhaseB value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseA
The TrueLoadPhaseA value of the Electrical System.
Remarks:
This property is used to retrieve the TrueLoadPhaseA value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoad
The TrueLoad value of the Electrical System.
Remarks:
This property is used to retrieve the TrueLoad value of the Electrical System.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.PowerFactor
The PowerFactor value of the Electrical System.
Remarks:
This property is used to retrieve the PowerFactor value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseC
The ApparentLoadPhaseC value of the Electrical System.
Remarks:
This property is used to retrieve the ApparentLoadPhaseC value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseB
The ApparentLoadPhaseB value of the Electrical System.
Remarks:
This property is used to retrieve the ApparentLoadPhaseB value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseA
The ApparentLoadPhaseA value of the Electrical System.
Remarks:
This property is used to retrieve the ApparentLoadPhaseA value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoad
The ApparentLoad value of the Electrical System.
Remarks:
This property is used to retrieve the ApparentLoad value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.Voltage
The Voltage value of the Electrical System.
Remarks:
This property is used to retrieve the Voltage value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.WireSizeString
The WireSize as a String of the Electrical System
Remarks:
This property is used to retrieve the WireSize String of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.LoadName
The LoadName of the Electrical System.
Remarks:
This property is used to retrieve the LoadName of the Electrical System.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.WireType
The wire type of the Electrical System.
Remarks:
This property is used to retrieve the wire type of the Electrical System.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.StartSlot
The Start Slot where the Electrical System is located in its panel.
Remarks:
This property is used to retrieve the Start Slot of the Electrical System.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitNumber
The CircuitNumber of the Electrical System.
Remarks:
This property is used to retrieve the CircuitNumber of the Electrical System.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.NewWires(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Electrical.WiringType)
Create a bunch of wires for the electrical system.
view: The view in which the wire is to be visible.
wiringType: Specify the wiring type (Arc or Chamfer) that is to be applied to all newly created wires.
Returns: New created wires
Throws Autodesk.Revit.Exceptions.ArgumentException: This method can only be used to create a bunch of wires according to specific pairs of elements,
so if there exists a null element in any pair of familyInstancePairs, the exception will be thrown.

Autodesk.Revit.DB.Electrical.ElectricalSystem.RemoveFromCircuit(Autodesk.Revit.DB.ElementSet)
remove a set of exist components from the Electrical System.
components: The components removed from the electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the components parameter Value is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the components cannot be removed from the system.
Remarks: If successful, all the components will remove from the system. Otherwise null is removed.
This method will only function with the Autodesk Revit MEP application.

Autodesk.Revit.DB.Electrical.ElectricalSystem.AddToCircuit(Autodesk.Revit.DB.ElementSet)
Add a set of exist components to the Electrical System.
components: The components added to the electrical system.
Returns: If successful, all the components will add to the system. Otherwise null is returned.
Remarks: This method will only function with the
Autodesk Revit MEP application.

Autodesk.Revit.DB.Electrical.ElectricalSystem
Provides access to the Electrical System in Autodesk Revit MEP.
Remarks:
The Electrical System object can only be queried in Autodesk Revit MEP.
Since:
2011